{
  "Wdecompose_target_modules": [
    "q_proj",
    "v_proj"
  ],
  "base_model_name_or_path": "google/gemma-3-1b-it",
  "bias": "none",
  "dora_simple": true,
  "enable_lora": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "lora_alpha": 64,
  "lora_dropout": 0.05,
  "merge_weights": false,
  "modules_to_save": null,
  "peft_type": "DORA",
  "r": 32,
  "target_modules": [
    "q_proj",
    "v_proj"
  ],
  "task_type": "CAUSAL_LM"
}